[{
    "title": "2048",
    "link": "https://tain101.github.io/2048/",
    "repository": "https://github.com/tain101/2048/tree/gh-pages",
    "points": [
        "I am attempting to make a AI that learns 2048. This differs from my previous projects because the game has a defined scoring system, opposed to the rather binary scores from the previous. Currently the game can be played by a user, or the AI can run the game. The AI is to resource intensive to know fully if it is learning properly."
    ]
}, {
    "title": "2048",
    "link": "https://tain101.github.io/2048/",
    "repository": "https://github.com/tain101/2048/tree/gh-pages",
    "points": [
        "I am attempting to make a AI that learns 2048. This differs from my previous projects because the game has a defined scoring system, opposed to the rather binary scores from the previous. Currently the game can be played by a user, or the AI can run the game. The AI is to resource intensive to know fully if it is learning properly."
    ]
}, {
    "title": "Checkers",
    "link": "https://tain101.github.io/Checkers",
    "repository": "https://github.com/tain101/Checkers/tree/gh-pages",
    "points": [
        "This was my second attempt at creating a genetic algorithms for a grid system. Originally I had planned to record moves and how long it takes to win/loose. Due to the potential randomness of games from start to end, it was impossible for the AI to make progress. Currently, each piece has it\"s own AI, and receives a score based on pieces taken, if it was kinged, and if the game was won."
    ]
}, {
    "title": "Life",
    "link": "https://tain101.github.io/Life",
    "repository": "https://github.com/tain101/Life/tree/gh-pages",
    "points": [
        "This is an experiment in genetic algorithms. The idea was to create units that would need to eat, mate, and avoid obstacles, in order for the species to survive. They would learn to navigate the map based on the moves their parents have made. Unfortunately at the time I had virtually zero experience with javascript so the code was too resource heavy to coninue. I hope to rewrite it at some point."
    ]
}]